<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2020/7/3
 * Time: 16:07
 */

// 个人/企业 资料中的选项字段
return [
    // 业务范围
    'service'       => [
        // 按擅长领域分类
        [
            'title'  => '擅长领域',
            '_child' => [
                1  => '视频监控',
                2  => '防盗报警',
                3  => '楼宇对讲',
                4  => '出入口控制',
                5  => '平台算法',
                6  => '智能家居',
                7  => '传输配件',
                97 => '其他',
            ]
        ],
        // 按业务场景分类
        [
            'title'  => '业务场景',
            '_child' => [
                8  => '智慧城市',
                9  => '智慧社区',
                10 => '智能交通',
                11 => '金融',
                12 => '能源',
                13 => '文教卫',
                14 => '公检法',
                15 => '智慧园区',
                98 => '其他',
            ]
        ],
        // 按工程范围分类
        [
            'title'  => '工程范围',
            '_child' => [
                16 => '停车场系统工程',
                17 => '门禁系统工程',
                18 => '考勤系统工程',
                19 => '消费系统工程',
                20 => '巡更系统工程',
                21 => '智能分析工程',
                22 => '安防系统综合管理工程',
                23 => '公共广播工程',
                24 => '视频会议工程',
                25 => '综合布线系统工程',
                26 => '大屏幕显示系统工程',
                27 => '防雷系统工程',
                99 => '其他',
            ]
        ],
    ],

    // 团队规模
    'team'          => [
        1 => '0-50人',
        2 => '50-100人',
        3 => '100-500人',
        4 => '500-1000人',
        5 => '1000人以上',
    ],

    // 年营收
    'income'        => [
        1 => '0-1000万',
        2 => '1000万-1亿',
        3 => '1亿-10亿',
        4 => '10亿-100亿',
        5 => '100亿以上',
    ],

    // 公司类型
    'company_type'  => [
        1  => '制造商',
        2  => '工程商',
        3  => '集成商',
        4  => '经销代理',
        5  => '科研/高校',
        6  => '协会/联盟',
        7  => '设计院',
        8  => '终端用户',
        9  => '投融资',
        10 => '其他',
        11 => '咨询机构',
        12 => '新闻媒体'
    ],

    // 公司职责
    'company_duty'  => [
        1 => '高管',
        2 => '研发',
        3 => '销售',
        4 => '市场',
        5 => '技术支持',
        6 => '采购',
        7 => '生产',
        8 => '其他',
    ],

    // 企业性质
    'nature'        => [
        1 => '国企',
        2 => '私营企业',
        3 => '中外合资',
        4 => '外商独资',
        5 => '港澳台',
        6 => '上市公司',
    ],

    // 企业荣誉
    'honer'         => [
        1 => '中国安防百强企业',
        2 => '平安城市推荐品牌',
        3 => '金鼎奖',
        4 => '中国安防外资30强',
        5 => '中国安防十大知名品牌',
        6 => '中国安防50强企业',
        7 => '智慧城市推荐品牌',
        8 => '十大新锐',
    ],

    // 企业资质
    'qualification' => [
        [
            'title'  => '安防工程企业资质',
            '_child' => [
                1 => '不限',
                2 => '一级',
                3 => '二级',
                4 => '三级',
            ]
        ],
        [
            'title'  => '工程设计资质',
            '_child' => [
                5 => '不限',
                6 => '甲级',
                7 => '乙级',
                8 => '丙级',
            ]
        ],
        [
            'title'  => '工程施工资质',
            '_child' => [
                9  => '不限',
                10 => '一级',
                11 => '二级',
                12 => '三级',
            ]
        ],
        [
            'title'  => '建筑智能化系统设计专项',
            '_child' => [
                13 => '不限',
                14 => '甲级',
                15 => '乙级',
            ]
        ],
        [
            'title'  => '计算机系统集成资质',
            '_child' => [
                16 => '不限',
                17 => '一级',
                18 => '二级',
                19 => '三级',
                20 => '四级',
            ]
        ],
        [
            'title'  => '工程总承包资格',
            '_child' => [
                21 => '不限',
                22 => '甲级',
                23 => '乙级',
                24 => '丙级',
                25 => '丁级',
            ]
        ],
        [
            'title'  => '涉密资质',
            '_child' => [
                26 => '不限',
                27 => '甲级',
                28 => '乙级',
                29 => '丙级',
            ]
        ],
        [
            'title'  => '建筑智能化资质',
            '_child' => [
                30 => '不限',
                31 => '一级',
                32 => '二级',
            ]
        ],
        [
            'title'  => '消防设施工程设计与施工资质',
            '_child' => [
                33 => '不限',
                34 => '一级',
                45 => '二级',
            ]
        ],
    ],
];